
## Plan Result (infrastructure)

[CI link](https://github.com/nangashi/dcr/actions/runs/7519463391)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 2 to change, 1 to destroy.</code></pre>

* Update
  * aws_iam_role.notification_chatbot
  * aws_sns_topic_policy.notification_sns_topic
* Replace
  * module.common_layer.aws_lambda_layer_version.layer


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_role.notification_chatbot will be updated in-place
  ~ resource "aws_iam_role" "notification_chatbot" {
        id                    = "ChatBotChannelRole-prd"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/CloudWatchReadOnlyAccess",
        ]
        name                  = "ChatBotChannelRole-prd"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_sns_topic_policy.notification_sns_topic will be updated in-place
  ~ resource "aws_sns_topic_policy" "notification_sns_topic" {
        id     = "arn:aws:sns:ap-northeast-1:384081048358:SlackNotification-prd"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ Service = "events.amazonaws.com" -> [
                              + "events.amazonaws.com",
                              + "cloudwatch.amazonaws.com",
                            ]
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.common_layer.aws_lambda_layer_version.layer must be replaced
-/+ resource "aws_lambda_layer_version" "layer" {
      ~ arn                         = "arn:aws:lambda:ap-northeast-1:384081048358:layer:common_layer-prd:1" -> (known after apply)
      ~ compatible_architectures    = [ # forces replacement
          + "x86_64",
        ]
      ~ created_date                = "2024-01-08T13:41:38.495+0000" -> (known after apply)
      ~ filename                    = "./lambda/common_layer/src/layer.zip" -> "/tmp/tmp.9usLHsKpKX/layer.zip"
      ~ id                          = "arn:aws:lambda:ap-northeast-1:384081048358:layer:common_layer-prd:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-northeast-1:384081048358:layer:common_layer-prd" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "rojSwBGqM6WKP2t0okwTrAXRqZc1HTqxbBeRVDmvMqA=" -> "yrYZGfBu8z/qCS5Zh4aLCW+DH5Y5NfywWO6pgsNlUwE=" # forces replacement
      ~ source_code_size            = 555 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ common_layer_arn               = "arn:aws:lambda:ap-northeast-1:384081048358:layer:common_layer-prd:1" -> (known after apply)
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":42,"Program":"tfcmt","SHA1":"893d737cfe9b8317f945dfa3616c9864a1d5f9e4","Target":"infrastructure","Vars":{},"WorkflowName":"Check Pull Requests"} -->